CSI API ETABS v1
cPropMaterial.SetMaterial Method
 DEPRECATED. Initializes a material property. If this function is called for an existing material property, all items for the material are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetMaterial(
	string Name,
	eMatType MatType,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetMaterial (
	Name As String,
	MatType As eMatType,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim MatType As eMatType
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetMaterial(Name,
	MatType, Color, Notes, GUID)
int SetMaterial(
	String^ Name,
	eMatType MatType,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetMaterial :
        Name : string *
        MatType : eMatType *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing or new material property. If this is an existing property, that property is modified; otherwise, a new property is added.
MatType
Type: ETABSv1.eMatType
 This is one of the items in the eMatType enumeration.
Color (Optional)
Type: System.Int32
Notes (Optional)
Type: System.String
GUID (Optional)
Type: System.String
 The GUID (global unique identifier), if any, assigned to the material. If this item is input as Default, the program assigns a GUID to the material.
Return Value
Type: Int32
 Returns zero if the material is successfully initialized; otherwise it returns a nonzero value.
Remarks
 This function is DEPRECATED. Please use AddMaterial(String, eMatType, String, String, String, String) instead.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace